[
    {
        "common_name": "Windflower",
        "latin_name": "Anemone blanda",
        "season": "autumn",
        "description": "Anemone is a genus of about 120 species of perennial flowering plants in the family Ranunculaceae, native to Europe, North America and Japan. The flower stem bears one or several beautiful flowers, with an involucre of three leaflets below each flower, giving this plant an spectacular appearance. Whether tall-growing or low-growing, these flowers will add beauty to your garden!",
        "fileName": "anemone.jpeg"
    },
    {
        "common_name": "Phlox",
        "latin_name": "Phlox paniculata",
        "season": "autumn",
        "description": "Phlox is a genus of about 70 species of annuals and perennials in the family Polemoniaceae, mostly native to North America. These plants have thick, strong stems, lance-shaped leaves and clusters of small, star-shaped flowers. The flowers have five petals that come in a wide range of colors. They are hardy and easy to grow in a variety of conditions.",
        "fileName": "phlox.jpeg"
    },
    {
        "common_name": "Sunflower",
        "latin_name": "Helianthus annuus",
        "season": "summer",
        "description": "Helianthus, better known as Sunflower, is a genus of about 70 species of annuals and perennials in the daisy family (Asteraceae), native to North America, with a few species from South America. Sunflowers have big, daisy-like flowers in bright colors often with a contrasting darker centre and large, bristly, dark green leaves. These sun-loving plants are recognized worldwide for their beauty, as well as agricultural importance.",
        "fileName": "sunflower.jpeg"
    },
    {
        "common_name": "Coneflower",
        "latin_name": "Echinacea",
        "season": "summer",
        "description": "Echinacea is a genus of about 10 species in the family Asteraceae, native to North America. Echinacea, commonly called Coneflower, has attractive and colorful daisy-like flowers, with cone-shaped central disc surrounded by a ring of petal-like rays. It has lance-shaped or oval-shaped dark green leaves and tall, slender, hairy stem that can reach up to 120 cm (4 ft) in height. These perennials are easy to maintain once you know the secrets to meeting their needs. They are heat and drought tolerant and will attract birds and pollinators in your garden.",
        "fileName": "coneflower.jpeg"
    },
    {
        "common_name": "Camellia",
        "latin_name": "Camellia",
        "season": "spring",
        "description": "Camellia is a genus of about 250 species of evergreen shrubs and trees in the Theaceae family, native to eastern Asia. Their perfectly shaped blooms come in a remarkable range of sizes, colors and forms. It is always lovely to see these long-blooming flowers in the garden. Camellias thrive best in partially shaded areas because they are sensitive to bright light. They are great for balconies, terraces, woodland gardens or in containers.",
        "fileName": "camellia.jpeg"
    },
    {
        "common_name": "Tulip",
        "latin_name": "Tulipa",
        "season": "spring",
        "description": "Tulips belong to the genus Tulipa in the lily family (Liliaceae). There are around 100 species and over 3000 different varieties of cultivated Tulips. They grow wild in Central Asia, through Siberia to China. Tulips are one of the most popular spring flowers and one of the most popular flowers worldwide. They come in many varieties of colors and shapes and are great for pots, borders and as cut flowers.",
        "fileName": "tulip.jpeg"
    },
    {
        "common_name": "Primrose",
        "latin_name": "Primula",
        "season": "spring",
        "description": "Primula is a genus of more than 400 species of herbaceous perennials in the family Primulaceae, widely distributed throughout the world. These early bloomers come in a variety of sizes, shapes and colors. They are one of the most popular ornamental plants. With their showy, bright, vibrant flowers that come in array of colors, Primulas are ideal for front borders, beds, edging, paths and walkways, shade gardens and rock gardens.",
        "fileName": "primrose.jpeg"
    },
    {
        "common_name": "Camas",
        "latin_name": "Camassia",
        "season": "summer",
        "description": "Camassia, commonly known as Camas or Quamash, is a genus of six species of flowering plants in the family Asparagaceae, native to North America. These plants produce narrow linear leaves and striking blooms in spring and summer. The flowers are star-shaped with six petals that may be blue, purple or white, depending on the species. They are recognisable by their long stamens, giving them a magical look overall. They are gorgeous in beds and borders, but also good as cut flowers. Once planted, they will come back reliably year after year to brighten up your yard!",
        "fileName": "camassia.jpeg"
    },
    {
        "common_name": "Russian sage",
        "latin_name": "Perovskia atriplicifolia",
        "season": "autumn",
        "description": "Perovskia is a genus in the family Lamiaceae, native to southwestern and central Asia. The genus consists of about 10 species of perennials and sub-shrubs. Perovskia produces showy spikes of tiny tubular flowers that bloom in summer and autumn. The foliage is fragrant and produces an aromatic sage-like scent. Perovskia is a beautiful plant and is easy to care for.",
        "fileName": "perovskia.jpeg"
    },
    {
        "common_name": "Panicle hydrangea",
        "latin_name": "Hydrangea paniculata",
        "season": "autumn",
        "description": "Panicle hydrangea is one of the best fall flowers for cold weather climates. Delicate clusters of star-shaped flowers occur in hues of white, pink, red or pale green. If left to dry on the plant in fall, they will stay looking good all winter.",
        "fileName": "panicle.jpeg"
    },
    {
        "common_name": "Garden mums",
        "latin_name": "Chrysanthemum",
        "season": "autumn",
        "description": "Chrysanthemum is a genus of about 40 species of perennials native to Asia and Europe, which belongs to the Asteraceae family. It is one of the most popular flowers in the world. It comes in various shapes, sizes and colors and produces wonderful flowers that bloom in summer and autumn. The plant is ideal for growing in beds and pots.",
        "fileName": "mums.jpeg"
    },
    {
        "common_name": "African daisy",
        "latin_name": "Osteospermum",
        "season": "autumn",
        "description": "Osteospermum is a genus of about 50 species of annuals, perennials and sub-shrubs in the family Asteraceae. Osteospermum has beautiful daisy-like flowers in a variety of colors. Like other members of the Asteraceae family, the blooms are actually flower heads composed of a central disc which contains a number of tiny individual flowers known as florets. Osteospermums are easy to maintain and will provide an abundance of color for many months.",
        "fileName": "daisy.jpeg"
    },
    {
        "common_name": "Weigela",
        "latin_name": "Weigela",
        "season": "spring",
        "description": "Weigela is a genus of about 10 species of flowering shrubs in the family Caprifoliaceae, native to open woodlands of eastern Asia. These species have attractive foliage and tubular or trumpet-shaped flowers that bloom in late spring and early summer, but also sporadically throughout the year. They are perfect for anyone who wishes to grow long blooming, flowering shrubs. They bring charm to any garden and never fail to catch the eye of passers-by!",
        "fileName": "weigela.jpeg"
    },
    {
        "common_name": "Hyacinth",
        "latin_name": "Hyacinthus",
        "season": "spring",
        "description": "Hyacinthus is a small genus of three species of bulbous flowering plants in the Asparagaceae family, native to Mediterranean and Middle East. The plant has narrow leaves that are folded lengthwise, and highly attractive and fragrant flowers which are borne in a raceme cluster at the top of the leafless stems. Hyacinth is extremely popular and praised because of its unique, rich and heavy scent. Hyacinths are great for gardens, as well as for bouquets and arrangements.",
        "fileName": "hyacinth.jpeg"
    },
    {
        "common_name": "Yaupon",
        "latin_name": "Ilex vomitoria",
        "season": "spring",
        "description": "Native from southern Virginia south to Florida and west to southeast Oklahoma and central Texas, Yaupon is a picturesque, upright, single- or multi-trunked shrub or small tree, growing 12-45 ft high but usually no higher than 25 ft. Female plants produce prodigious amounts of bright red, persistent berries. The leaves are dark green and small, usually less than 1 1/2 in. long.",
        "fileName": "yaupon.jpeg"
    },
    {
        "common_name": "Sea holly",
        "latin_name": "Eryngium",
        "season": "summer",
        "description": "Eryngium, also known as Sea Holly, is a genus of about 250 species in the family Apiaceae, mostly native to Europe and the Mediterranean. Most species are perennials, but some are annuals. The Sea Holly produces showy and attractive thistle-like flower heads surrounded by spiny silvery-blue bracts on strong stems. These sun loving plants will bloom in summer and attract butterflies and bees to your garden.",
        "fileName": "sea_holly.jpeg"
    },
    {
        "common_name": "Hibiscus",
        "latin_name": "H. moscheutos",
        "season": "summer",
        "description": "Hibiscus is a genus of about 400 different species in the family Malvaceae, native to warm temperate and tropical regions. These plants can be woody shrubs or small trees, as well as annuals or perennials. In the world of flowers, they are known for their colorful, large and trumpet-shaped flowers. These flowers will add color and interest to your garden, while also attracting hummingbirds and butterflies.",
        "fileName": "hibiscus.jpeg"
    },
    {
        "common_name": "Lily",
        "latin_name": "Lilium",
        "season": "summer",
        "description": "Lilium is a genus of about 100 species of bulbous perennials that come in different shapes and colors. The genus belongs to the family Liliaceae and is native to the northern hemisphere. They are erect perennials with usually narrow leaves and flowers characterized by six petal-like segments (three petals in addition to three sepals) which may form the shape of a trumpet. Most of them are elegant, bright colored and fragrant.",
        "fileName": "lily.jpeg"
    }
]